{
  "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration",
  "displayName": "macOS Enrollment Restriction",
  "description": "Controls macOS device enrollment settings and restrictions for managed devices.",
  "platformType": "mac",
  "platformRestriction": {
    "platformBlocked": false,
    "personalDeviceEnrollmentBlocked": false
  }
}